Revit 2023 API
IFCLogical Enumeration
 A datatype can have values TRUE, FALSE or UNKNOWN.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2013
Syntax
C#
public enum IFCLogical
Visual Basic
Public Enumeration IFCLogical
Visual C++
public enum class IFCLogical
Members
Member name | Description
False |  False.
Unknown |  Unknown.
True |  True.
See Also
Autodesk.Revit.DB.IFC Namespace